[
    {
        "Title":"Moana 2",
        "Runtime":"3h 3m",
        "Poster":"https://th.bing.com/th/id/OIF.e8DOjOFBylFDqf2prO8WaA?rs=1&pid=ImgDetMain",
        "Plot":"After receiving an unexpected call from her wayfinding ancestors, Moana must journey to the far seas of Oceania and into dangerous, long-lost waters for an adventure unlike anything she's ever faced.",
        "ratings":"7.3/10 144k"
    },
    {
        "Title":"Leo",
        "Runtime":"2h 21m",
        "Poster":"https://th.bing.com/th/id/OIP.BAzVEOna4GEXtOeC4yJDDAHaLH?rs=1&pid=ImgDetMain",
        "Plot":"A fading celebrity takes a black-market drug: a cell-replicating substance that temporarily creates a younger, better version of herself.",
        "ratings":"7.4/10 151k"
    },
    {
        "Title":"Wicked",
        "Runtime":"1h 31m",
        "Poster":"https://th.bing.com/th/id/OIP.sWmb39kM_MlV5jkXRfg9GgHaHV?rs=1&pid=ImgDetMain",
        "Plot":"Elphaba, a misunderstood young woman because of her green skin, and Glinda, a popular girl, become friends at Shiz University in the Land of Oz. After an encounter with the Wonderful Wizard of Oz, their friendship reaches a crossroads.",
        "ratings":"6.7/10 144k"
    },
    {
        "Title":"Gladiator II",
        "Runtime":"2h 50m",
        "Poster":"https://cdn.gracza.pl/galeria/mdb/f/-1951891500.jpg",
        "Plot":"After his home is conquered by the tyrannical emperors who now lead Rome, Lucius is forced to enter the Colosseum and must look to his past to find strength to return the glory of Rome to its people.",
        "ratings":"8.2/10 7.1k"
    },
    {
        "Title":"Red One",
        "Runtime":"2h 8m",
        "Poster":"https://i.ytimg.com/vi/OrrP4x7E1Fk/maxresdefault.jpg",
        "Plot":"After Santa Claus is kidnapped, the North Pole's Head of Security must team up with the world's most infamous bounty hunter in a globe-trotting, action-packed mission to save Christmas.",
        "ratings":"7.7/10 403k"
    },
    {
        "Title":"Lubber Pandhu",
        "Runtime":"2h 26m",
        "Poster":"https://m.media-amazon.com/images/M/MV5BNTA4OTZlZDctMjIwOS00MDg5LWIzMzYtZWQ2ZWFkNTI3M2IxXkEyXkFqcGdeQXVyMTQ3Mzk2MDg4._V1_.jpg",
        "Plot":"Set against the rural backdrop, explores gully cricket stars Gethu and Anbu's intense rivalry. Anbu's romantic involvement with Gethu's daughter escalates the clash. Their skills and emotions are put to the ultimate test.",
        "ratings":"8.2/10 4.4k"
    },
    {
        "Title":"Venum: The Last One",
        "Runtime":"2h 32m",
        "Poster":"https://th.bing.com/th/id/OIP.meCmG2ALi_Wi8j1A6itMpwHaLH?rs=1&pid=ImgDetMain",
        "Plot":"Eddie and Venom, on the run, face pursuit from both worlds. As circumstances tighten, they're compelled to make a heart-wrenching choice that could mark the end of their symbiotic partnership.",
        "ratings":"5.3/10 12k"
    },
    {
        "Title":"Heretic",
        "Runtime":"2h 30m",
        "Poster":"https://static1.srcdn.com/wordpress/wp-content/uploads/2024/09/heretic-2024-official-poster.jpg",
        "Plot":"Two young religious women are drawn into a game of cat-and-mouse in the house of a strange man.",
        "ratings":"7.2/10 7.1k"
    },
    {
        "Title":"A Real Pain",
        "Runtime":"2h 30m",
        "Poster":"https://th.bing.com/th/id/OIP.KmJ98e9VaV9ntOHZL9E6FgHaLH?rs=1&pid=ImgDetMain",
        "Plot":"Mismatched cousins reunite for a tour through Poland to honor their beloved grandmother. The adventure takes a turn when the odd-couple's old tensions resurface against the backdrop of their family history.",
        "ratings":"8.2/10 1.8k"
    },
    {
        "Title":"Meiyazhagan",
        "Runtime":"2h 57m",
        "Poster":"https://th.bing.com/th/id/OIP.a-YGUry5aOQwHWt_NBU3hgHaLH?rs=1&pid=ImgDetMain",
        "Plot":"A man's life is changed when he bumps into someone from his hometown in this moving Tamil-language drama; gentle scenes are occasionally punctuated by sporting threat and recollections of violence.",
        "ratings":"8.4/10 10k"
    },
    {
        "Title":"Smile2",
        "Runtime":"2h 56m",
        "Poster":"https://th.bing.com/th/id/OIP.pHY_cke6EYxgDIoqMU_ZjgHaK-?rs=1&pid=ImgDetMain",
        "Plot":"About to embark on a world tour, global pop sensation Skye Riley begins experiencing increasingly terrifying and inexplicable events. Overwhelmed by the escalating horrors and the pressures of fame, Skye is forced to face her past.",
        "ratings":"6.9/10 54k"
    },
    {
        "Title":"Home Alone",
        "Runtime":"2h 47m",
        "Poster":"https://th.bing.com/th/id/OIP.gNyS6XAosU23kPuItDeq-wHaLH?rs=1&pid=ImgDetMain",
        "Plot":"An eight-year-old troublemaker, mistakenly left home alone, must defend his home against a pair of burglars on Christmas Eve.",
        "ratings":"8.5/10 9.3k"
    },
    {
        "Title":"The Batman",
        "Runtime":"2h 27m",
        "Poster":"https://m.media-amazon.com/images/M/MV5BMjY2ZmMyZTMtMDBiYi00MTZlLWFmZjAtYzE2NWE4OTBmYTJiXkEyXkFqcGdeQXVyMTI1MzYzODMy._V1_.jpg",
        "Plot":"When a sadistic serial killer begins murdering key political figures in Gotham, the Batman is forced to investigate the city's hidden corruption and question his family's involvement.",
        "ratings":"7.0/10 36k"
    },
    {
        "Title":"The Wild Robot",
        "Runtime":"1h 42m",
        "Poster":"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:auto/h:auto/q:75/https://bleedingcool.com/wp-content/uploads/2024/06/WRB_Tree1Sheet6_RGB_1.jpg",
        "Plot":"After a shipwreck, an intelligent robot called Roz is stranded on an uninhabited island. To survive the harsh environment, Roz bonds with the island's animals and cares for an orphaned baby goose.",
        "ratings":"8.3/10 89k"
    },
    {
        "Title":"Bonhoeffer:Pastor,Spy,Assassin",
        "Runtime":"1h 45m",
        "Poster":"https://th.bing.com/th?id=OIF.ja%2fmIB5hIU47ZzBZv7qs8Q&rs=1&pid=ImgDetMain",
        "Plot":"As the world teeters on the brink of annihilation, Dietrich Bonhoeffer joins a deadly plot to assassinate Hitler, risking his faith and fate to save millions of Jews from genocide.",
        "ratings":"7.6/10 33k"
    }
    

]